Revit 2027 API
DirectShape.IsSupportedDocument Method
 Tests whether a DirectShape or a DirectShapeType may be created in this document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsSupportedDocument(
	Document document
)
Public Shared Function IsSupportedDocument (
	document As Document
) As Boolean
public:
static bool IsSupportedDocument(
	Document^ document
)
static member IsSupportedDocument :
        document : Document -> bool
Parameters
document Document
 Document to be tested.
Return Value
Boolean
 True if a DirectShape or a DirectShapeType object can be created in this document, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Some types of Document, such as 2D families, can't support DirectShape functionality.
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace